package ru.yandex;

public class Main3 {
    // bucket[0] -> null
    // bucket[1] -> null
    // bucket[2] -> Node("bar", 77)
    // bucket[3] -> null
    // bucket[4] -> null
    // bucket[5] -> null
    // ...
    // bucket[10] -> Node("hello", 1)
    // bucket[11] -> null
    // bucket[12] -> null
    // bucket[13] -> null
    // bucket[14] -> null
    // bucket[15] -> null
    public static void main(String[] args) {
        String key = "hello";

        //map.put("hello", 1);
        //map.put("bar", 77);

        //0-51

        // -1-
        // 99163451
        //     99163451 % 16 = 11 (остаток от деления)
        // или 99163451 & 15 = 11

        /*
        Значение улучшенного хэша: 99163451
        Значение улучшенного хэша в в двоичной системе: 1 0 1 1 1 1 0 1 0 0 1 0 0 0 1 1 1 0 1 0 0 1 1 1 0 1 1

        Длина массива: 15
        Длина массива в двоичной системе:  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 = 8 + 4 + 2 + 1 = 15

        int index = hash * (length - 1);
        // 99163541 & 15 = 11

        1 0 1 1 1 1 0 1 0 0 1 0 0 0 1 1 1 0 1 0 0 1 1 1 0 1 1
      & 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1
        0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 1 = 8 + 0 + 2 + 1 = 11

        - 2 -
        Значение улучшенного хэша: 97298
        Значение улучшенного хэша в в двоичной системе: 10111110000010010

        Длина массива: 15
        Длина массива в двоичной системе:  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 = 8 + 4 + 2 + 1 = 15

        int index = hash * (length - 1);
        // 97298 & 15 = 2

        1 0 1 1 1 1 1 0 0 0 0 0 1 0 0 1 0
      & 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1
        0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 = 2

         */
    }
}
